/******************************************************************************

                  版权所有 (C), 2001-2011, 神州数码网络有限公司

 ******************************************************************************
  文 件 名   : fw_file.h
  版 本 号   : 初稿
  作    者   : bseazeng
  生成日期   : 2017年12月25日 星期一
  最近修改   :
  功能描述   : fw_file.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2017年12月25日 星期一
    作    者   : bseazeng
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "list.h"
/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __FW_FILE_H__
#define __FW_FILE_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

#define FILE_LINE_BUF_SIZE (1024)

struct value_list_ 
{
	char *key;
	char *value;
	struct list_head next_value;
};
typedef struct file_node_ value_list;

struct file_list_
{
    char *filename;
	struct list_head content; //指向value_list 结构
	struct list_head next_file;
};
typedef struct file_list_ file_list;

extern int readFile(char *filename, file_list head);
extern char *getStrings(char *key,char *filename);
extern int setStrings(char *key,char *value,char *filename);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __FW_FILE_H__ */
